app/Models/ModelAuth.php

SELECT *
FROM `tb_user`
WHERE `email` = 'admin@yopmail.com'
AND `password` = 'admin123'
---
    public function login($email, $password)
    {
        return $this->db->table('tb_user')->where([
            'email' => $email,
            'password' => $password
        ])->get()->getRowArray();