app/Models/ModelLokasi.php

    public function getAllData()
    {
        return $this->db->table('tb_lokasi')
            ->get()
            ->getResultArray();
---
SELECT *
FROM `tb_lokasi`

    public function getDataById($id_lokasi)
    {
        return $this->db->table('tb_lokasi')
            ->where('id_lokasi', $id_lokasi)
            ->get()
            ->getRowArray();
---
SELECT *
FROM `tb_lokasi`
WHERE `id_lokasi` = '1'

    public function updateData($data = null)
    {
        $this->db->table('tb_lokasi')
            ->where('id_lokasi', $data['id_lokasi'])
            ->update($data);
---
UPDATE `tb_lokasi` SET `id_lokasi` = '1', `nama_lokasi` = 'Lokasi 1', `alamat_lokasi` = 'Jl. Haji Kadir Rajabasa Bandar Lampung', `latitude` = '-5.373987', `longitude` = '105.236229'
WHERE `id_lokasi` = '1'